; domain
;; source: ...
;; updates:
;;   - :negative-preconditions added
;;   - turn_to action has a new precondition (not (pointing ?s ?d_new))

(define (domain satellite)
  (:requirements :strips :typing :negative-preconditions)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and
        (pointing ?s ?d_prev)
        (not (pointing ?s ?d_new)))
   :effect (and
        (pointing ?s ?d_new)
        (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and
        (on_board ?i ?s)
        (power_avail ?s))
   :effect (and
        (power_on ?i)
        (not (calibrated ?i))
        (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
;; satellites=8, instruments=15, modes=3, directions=8, out_folder=training/easy, instance_id=73, seed=106

(define (problem satellite-73)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 - direction
    )
 (:init 
    (pointing sat1 dir8)
    (pointing sat2 dir1)
    (pointing sat3 dir8)
    (pointing sat4 dir1)
    (pointing sat5 dir5)
    (pointing sat6 dir2)
    (pointing sat7 dir4)
    (pointing sat8 dir8)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (calibration_target ins1 dir6)
    (calibration_target ins2 dir7)
    (calibration_target ins3 dir8)
    (calibration_target ins4 dir5)
    (calibration_target ins5 dir4)
    (calibration_target ins6 dir8)
    (calibration_target ins7 dir5)
    (calibration_target ins8 dir8)
    (calibration_target ins9 dir3)
    (calibration_target ins10 dir3)
    (calibration_target ins11 dir5)
    (calibration_target ins12 dir6)
    (calibration_target ins13 dir8)
    (calibration_target ins14 dir6)
    (calibration_target ins15 dir2)
    (on_board ins1 sat6)
    (on_board ins2 sat1)
    (on_board ins3 sat4)
    (on_board ins4 sat8)
    (on_board ins5 sat2)
    (on_board ins6 sat7)
    (on_board ins7 sat3)
    (on_board ins8 sat5)
    (on_board ins9 sat1)
    (on_board ins10 sat2)
    (on_board ins11 sat6)
    (on_board ins12 sat2)
    (on_board ins13 sat3)
    (on_board ins14 sat6)
    (on_board ins15 sat8)
    (supports ins14 mod2)
    (supports ins1 mod1)
    (supports ins1 mod3)
    (supports ins8 mod1)
    (supports ins1 mod2)
    (supports ins12 mod1)
    (supports ins11 mod1)
    (supports ins15 mod1)
    (supports ins11 mod3)
    (supports ins2 mod3)
    (supports ins8 mod2)
    (supports ins7 mod3)
    (supports ins2 mod1)
    (supports ins13 mod1)
    (supports ins8 mod3)
    (supports ins9 mod2)
    (supports ins5 mod1)
    (supports ins5 mod3)
    (supports ins9 mod3)
    (supports ins4 mod3)
    (supports ins13 mod2)
    (supports ins9 mod1)
    (supports ins3 mod3)
    (supports ins14 mod3)
    (supports ins2 mod2)
    (supports ins10 mod3)
    (supports ins6 mod3))
 (:goal  (and (pointing sat2 dir2)
   (pointing sat5 dir1)
   (pointing sat6 dir2)
   (pointing sat8 dir6)
   (have_image dir7 mod3)
   (have_image dir4 mod3)
   (have_image dir5 mod2)
   (have_image dir6 mod2)
   (have_image dir5 mod1)
   (have_image dir7 mod1)
   (have_image dir4 mod2)
   (have_image dir2 mod1)
   (have_image dir6 mod1)
   (have_image dir8 mod1)
   (have_image dir7 mod2)
   (have_image dir8 mod3)
   (have_image dir2 mod3)
   (have_image dir1 mod2)
   (have_image dir5 mod3)
   (have_image dir3 mod3))))

; plan
1. (turn_to sat8 dir6 dir8)
   deleted: (pointing sat8 dir8)
   added: (pointing sat8 dir6)
   goals met: 2 of 20
2. (switch_on ins8 sat5)
   deleted: (power_avail sat5)
   added: (power_on ins8)
   goals met: 2 of 20
3. (turn_to sat5 dir8 dir5)
   deleted: (pointing sat5 dir5)
   added: (pointing sat5 dir8)
   goals met: 2 of 20
4. (calibrate sat5 ins8 dir8)
   added: (calibrated ins8)
   goals met: 2 of 20
5. (take_image sat5 dir8 ins8 mod1)
   added: (have_image dir8 mod1)
   goals met: 3 of 20
6. (take_image sat5 dir8 ins8 mod3)
   added: (have_image dir8 mod3)
   goals met: 4 of 20
7. (turn_to sat5 dir7 dir8)
   deleted: (pointing sat5 dir8)
   added: (pointing sat5 dir7)
   goals met: 4 of 20
8. (take_image sat5 dir7 ins8 mod1)
   added: (have_image dir7 mod1)
   goals met: 5 of 20
9. (take_image sat5 dir7 ins8 mod2)
   added: (have_image dir7 mod2)
   goals met: 6 of 20
10. (take_image sat5 dir7 ins8 mod3)
   added: (have_image dir7 mod3)
   goals met: 7 of 20
11. (turn_to sat5 dir3 dir7)
   deleted: (pointing sat5 dir7)
   added: (pointing sat5 dir3)
   goals met: 7 of 20
12. (take_image sat5 dir3 ins8 mod3)
   added: (have_image dir3 mod3)
   goals met: 8 of 20
13. (turn_to sat5 dir4 dir3)
   deleted: (pointing sat5 dir3)
   added: (pointing sat5 dir4)
   goals met: 8 of 20
14. (take_image sat5 dir4 ins8 mod2)
   added: (have_image dir4 mod2)
   goals met: 9 of 20
15. (take_image sat5 dir4 ins8 mod3)
   added: (have_image dir4 mod3)
   goals met: 10 of 20
16. (turn_to sat5 dir5 dir4)
   deleted: (pointing sat5 dir4)
   added: (pointing sat5 dir5)
   goals met: 10 of 20
17. (take_image sat5 dir5 ins8 mod1)
   added: (have_image dir5 mod1)
   goals met: 11 of 20
18. (take_image sat5 dir5 ins8 mod2)
   added: (have_image dir5 mod2)
   goals met: 12 of 20
19. (take_image sat5 dir5 ins8 mod3)
   added: (have_image dir5 mod3)
   goals met: 13 of 20
20. (turn_to sat5 dir6 dir5)
   deleted: (pointing sat5 dir5)
   added: (pointing sat5 dir6)
   goals met: 13 of 20
21. (take_image sat5 dir6 ins8 mod1)
   added: (have_image dir6 mod1)
   goals met: 14 of 20
22. (take_image sat5 dir6 ins8 mod2)
   added: (have_image dir6 mod2)
   goals met: 15 of 20
23. (turn_to sat5 dir2 dir6)
   deleted: (pointing sat5 dir6)
   added: (pointing sat5 dir2)
   goals met: 15 of 20
24. (take_image sat5 dir2 ins8 mod1)
   added: (have_image dir2 mod1)
   goals met: 16 of 20
25. (take_image sat5 dir2 ins8 mod3)
   added: (have_image dir2 mod3)
   goals met: 17 of 20
26. (turn_to sat5 dir1 dir2)
   deleted: (pointing sat5 dir2)
   added: (pointing sat5 dir1)
   goals met: 18 of 20
27. (turn_to sat2 dir2 dir1)
   deleted: (pointing sat2 dir1)
   added: (pointing sat2 dir2)
   goals met: 19 of 20
28. (take_image sat5 dir1 ins8 mod2)
   added: (have_image dir1 mod2)
   goals met: 20 of 20
